import styles from './formScreen.module.css'
import { ContactForm } from '../../features'

export const FormScreen = () => {

    return (
        <section className={styles.screen} id='contacts'>
            <div className={styles.screen__main}>
                <div className={styles.screen__textBlock}>
                    <div>
                        <h2
                            className={styles.screen__title}
                        >
                            Помощь и поддержка
                        </h2>
                        <p
                            className={styles.screen__text}
                        >
                            Отправьте нам письмо по адресу: radar-analytica@inbox.ru. Мы свяжемся с вами в течение 24 часов!
                        </p>
                    </div>

                    <div>
                        <div className={styles.screen__bar}>
                            <svg width="50" height="50" viewBox="0 0 50 50" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <rect width="50" height="50" rx="10" fill="#E0EBFF" />
                                <path fillRule="evenodd" clipRule="evenodd" d="M25 15C29.714 15 32.0711 15 33.5355 16.4645C34.0394 16.9683 34.3699 17.5779 34.5867 18.3527L18.3527 34.5867C17.5779 34.3699 16.9683 34.0394 16.4645 33.5355C15 32.0711 15 29.714 15 25C15 20.286 15 17.9289 16.4645 16.4645C17.9289 15 20.286 15 25 15ZM18.5 21.7573C18.5 23.5422 19.6171 25.625 21.36 26.3698C21.7663 26.5434 22.2337 26.5434 22.64 26.3698C24.3829 25.625 25.5 23.5422 25.5 21.7573C25.5 19.9584 23.933 18.5 22 18.5C20.067 18.5 18.5 19.9584 18.5 21.7573Z" fill="#6083E7" />
                                <path d="M23.5 22C23.5 22.8284 22.8284 23.5 22 23.5C21.1716 23.5 20.5 22.8284 20.5 22C20.5 21.1716 21.1716 20.5 22 20.5C22.8284 20.5 23.5 21.1716 23.5 22Z" fill="#6083E7" />
                                <g opacity="0.5">
                                    <path d="M34.8893 20.1719C35.0002 21.4334 35.0002 23.0059 35.0002 25.0002C35.0002 29.1339 35.0002 31.4552 34.0128 32.9515L28.0613 27L34.8893 20.1719Z" fill="#6083E7" />
                                    <path d="M32.9523 34.0123L27.0006 28.0607L20.1719 34.8893C21.4334 35.0002 23.0059 35.0002 25.0002 35.0002C29.1346 35.0002 31.4559 35.0002 32.9523 34.0123Z" fill="#6083E7" />
                                </g>
                            </svg>
                            <p
                                className={styles.screen__text}
                            >
                                117105, г. Москва,ул. проезд Нагатинский, 1-й, д.2
                            </p>
                        </div>
                        <div className={styles.screen__bar}>
                            <svg width="50" height="50" viewBox="0 0 50 50" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <rect width="50" height="50" rx="10" fill="#E0EBFF" />
                                <path opacity="0.5" d="M27.2 16H22.8C18.6516 16 16.5775 16 15.2887 17.318C14 18.636 14 20.7574 14 25C14 29.2426 14 31.364 15.2887 32.682C16.5775 34 18.6516 34 22.8 34H27.2C31.3484 34 33.4225 34 34.7113 32.682C36 31.364 36 29.2426 36 25C36 20.7574 36 18.636 34.7113 17.318C33.4225 16 31.3484 16 27.2 16Z" fill="#6083E7" />
                                <path d="M32.1284 21.033C32.4784 20.7413 32.5257 20.2211 32.234 19.8711C31.9423 19.5211 31.4221 19.4738 31.0721 19.7655L28.6973 21.7444C27.671 22.5997 26.9585 23.1915 26.357 23.5784C25.7747 23.9529 25.3798 24.0786 25.0002 24.0786C24.6206 24.0786 24.2258 23.9529 23.6435 23.5784C23.0419 23.1915 22.3294 22.5997 21.3032 21.7444L18.9284 19.7655C18.5783 19.4738 18.0581 19.5211 17.7664 19.8711C17.4747 20.2211 17.522 20.7413 17.8721 21.033L20.2882 23.0465C21.2632 23.859 22.0534 24.5176 22.7509 24.9661C23.4775 25.4334 24.185 25.7286 25.0002 25.7286C25.8154 25.7286 26.523 25.4334 27.2495 24.9661C27.947 24.5176 28.7372 23.859 29.7122 23.0465L32.1284 21.033Z" fill="#6083E7" />
                            </svg>
                            <p
                                className={styles.screen__text}
                            >
                                radar-analytica@inbox.ru
                            </p>
                        </div>
                    </div>
                </div>

                <div className={styles.screen__formContainer}>
                    <h3 className={styles.screen__formTitle}>
                        Напишите нам
                    </h3>
                    <ContactForm />
                </div>
            </div>
        </section>
    )
}