import React, { useState, useContext, useEffect } from 'react';
import styles from './nuSubscriptionWarningBlock.module.css';
import AuthContext from '@/service/AuthContext';
import { getDayDeclension } from '@/service/utils';
// import { URL } from '@/service/config';
import { Button, ConfigProvider } from 'antd';
import ErrorModal from '../modals/errorModal/errorModal';
import { useDemoMode } from '@/app/providers/DemoDataProvider';
import SubscriptionModal from "@/components/sharedComponents/modals/subscriptionModal/subscriptionModal";

const INIT_REQUEST_STATUS = {
  isLoading: false,
  isSuccess: false,
  isError: false,
  message: ''
};

const NoSubscriptionWarningBlock = ({ className = '', isOnMainPage = false }) => {
  const { user, authToken, logout } = useContext(AuthContext);
  const [requestStatus, setRequestStatus] = useState(INIT_REQUEST_STATUS);
  const [isModalVisible, setIsModalVisible] = useState(false);
  // const {isDemoUser} = useDemoMode();
  const isDemoUser = true;

  const testPeriodActivation = async () => {
    setIsModalVisible(true);
    // setRequestStatus({...INIT_REQUEST_STATUS, isLoading: true});
    // try {
    //   let response = await fetch(`${URL}/api/user/subscription`, {
    //     method: 'POST',
    //     headers: {
    //       'Content-Type': 'application/json',
    //       authorization: 'JWT ' + authToken,
    //     },
    //     body: JSON.stringify({
    //       ...user,
    //       test: true
    //     })
    //   });
    //
    //   if (!response.ok) {
    //     setRequestStatus({...INIT_REQUEST_STATUS, isError: true, message: 'Не удалось активировать тестовый период'});
    //     return;
    //   }
    //
    //   setRequestStatus({...INIT_REQUEST_STATUS, isSuccess: true, message: 'Тестовый период активирован'});
    //   return;
    //
    // } catch (error) {
    //   console.error(error);
    //   setRequestStatus({...INIT_REQUEST_STATUS, isError: true, message: error.message});
    // }
  };

  useEffect(() => {
    if (requestStatus.isSuccess) {
      setTimeout(() => {
        setRequestStatus({ ...INIT_REQUEST_STATUS });
      }, 2000);
    }
  }, [requestStatus.isSuccess]);

  const regularBlock = (
    <div className={`${styles.block} ${className}`}>
      <div className={styles.block__column}>
        <div className={styles.block__titleWrapper}>
          <div className={styles.block__iconWrapper}>
            <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path
                d="M18.3033 12.8089L17.5701 12.1289L18.3033 12.8089ZM11.2322 5.73783L11.9122 6.47103L11.2322 5.73783ZM21.6606 4.27232L22.6522 4.402L21.6606 4.27232ZM19.7688 2.38046L19.8985 3.37202L19.7688 2.38046ZM6.4941 12.6506L7.392 13.0908L6.4941 12.6506ZM11.3905 17.547L10.9503 16.6491L11.3905 17.547ZM5.20674 17.8674C5.59726 17.4769 5.59727 16.8437 5.20674 16.4532C4.81622 16.0627 4.18305 16.0627 3.79253 16.4532L5.20674 17.8674ZM0.9641 19.2816C0.573576 19.6722 0.573576 20.3053 0.9641 20.6958C1.35462 21.0864 1.98779 21.0864 2.37831 20.6958L0.9641 19.2816ZM7.32806 19.9887C7.71858 19.5982 7.71858 18.965 7.32806 18.5745C6.93754 18.184 6.30437 18.184 5.91385 18.5745L7.32806 19.9887ZM4.49963 19.9887C4.10911 20.3793 4.10911 21.0124 4.49963 21.4029C4.89016 21.7935 5.52332 21.7935 5.91385 21.4029L4.49963 19.9887ZM10.5958 21.082L11.5858 20.9406L11.5858 20.9406L10.5958 21.082ZM15.7577 17.6172L16.7477 17.4758L15.7577 17.6172ZM2.95907 13.4453L3.10049 12.4553L3.10049 12.4553L2.95907 13.4453ZM6.42389 8.2834L6.28247 9.27335L6.28247 9.27335L6.42389 8.2834ZM9.92676 16.4532L7.5879 14.1143L6.17369 15.5286L8.51254 17.8674L9.92676 16.4532ZM17.5701 12.1289C15.7103 14.1341 12.6724 15.8048 10.9503 16.6491L11.8307 18.4449C13.5735 17.5905 16.906 15.786 19.0365 13.4889L17.5701 12.1289ZM7.392 13.0908C8.23627 11.3687 9.90696 8.33084 11.9122 6.47103L10.5522 5.00464C8.25509 7.13512 6.45061 10.4676 5.5962 12.2104L7.392 13.0908ZM20.6691 4.14264C20.366 6.46004 19.5653 9.97761 17.5701 12.1289L19.0365 13.4889C21.4892 10.8444 22.3429 6.76695 22.6522 4.402L20.6691 4.14264ZM11.9122 6.47103C14.0635 4.4758 17.5811 3.6751 19.8985 3.37202L19.6391 1.38891C17.2742 1.69821 13.1967 2.55195 10.5522 5.00464L11.9122 6.47103ZM22.6522 4.402C22.8846 2.62531 21.4158 1.15654 19.6391 1.38891L19.8985 3.37202C20.3726 3.31001 20.7311 3.6685 20.6691 4.14264L22.6522 4.402ZM7.5879 14.1143C7.29549 13.8219 7.23366 13.4138 7.392 13.0908L5.5962 12.2104C5.03802 13.349 5.31513 14.67 6.17369 15.5286L7.5879 14.1143ZM8.51254 17.8674C9.3711 18.726 10.6921 19.0031 11.8307 18.4449L10.9503 16.6491C10.6273 16.8074 10.2192 16.7456 9.92676 16.4532L8.51254 17.8674ZM3.79253 16.4532L0.9641 19.2816L2.37831 20.6958L5.20674 17.8674L3.79253 16.4532ZM5.91385 18.5745L4.49963 19.9887L5.91385 21.4029L7.32806 19.9887L5.91385 18.5745ZM13 6.79845C11.8284 7.97003 11.8284 9.86952 13 11.0411L14.4142 9.62688C14.0237 9.23635 14.0237 8.60319 14.4142 8.21267L13 6.79845ZM13 11.0411C14.1716 12.2127 16.0711 12.2127 17.2426 11.0411L15.8284 9.62688C15.4379 10.0174 14.8047 10.0174 14.4142 9.62688L13 11.0411ZM17.2426 11.0411C18.4142 9.86952 18.4142 7.97003 17.2426 6.79845L15.8284 8.21267C16.219 8.60319 16.219 9.23636 15.8284 9.62688L17.2426 11.0411ZM17.2426 6.79845C16.0711 5.62688 14.1716 5.62688 13 6.79845L14.4142 8.21267C14.8047 7.82214 15.4379 7.82214 15.8284 8.21267L17.2426 6.79845ZM14.7678 17.7586L11.5858 20.9406L13 22.3548L16.182 19.1728L14.7678 17.7586ZM11.5858 20.9406L11.1615 17.9707L9.18163 18.2536L9.60589 21.2234L11.5858 20.9406ZM14.4849 15.7787L14.7678 17.7586L16.7477 17.4758L16.4648 15.4959L14.4849 15.7787ZM11.5858 20.9406L9.60589 21.2234C9.83897 22.855 11.8346 23.5202 13 22.3548L11.5858 20.9406ZM16.182 19.1728C16.6271 18.7277 16.8367 18.099 16.7477 17.4758L14.7678 17.7586L14.7678 17.7586L16.182 19.1728ZM4.86825 7.85913L1.68627 11.0411L3.10049 12.4553L6.28247 9.27335L4.86825 7.85913ZM2.81765 14.4352L5.78749 14.8595L6.07034 12.8796L3.10049 12.4553L2.81765 14.4352ZM8.54521 7.57629L6.56531 7.29345L6.28247 9.27335L8.26237 9.55619L8.54521 7.57629ZM1.68627 11.0411C0.520897 12.2065 1.18612 14.2022 2.81765 14.4352L3.10049 12.4553L3.10049 12.4553L1.68627 11.0411ZM6.28247 9.27335L6.56531 7.29345C5.94212 7.20442 5.31339 7.414 4.86825 7.85913L6.28247 9.27335Z"
                fill="#5329FF" />
            </svg>
          </div>
          <p className={styles.block__title}>Добро пожаловать в сервис Радар-Аналитика!</p>
        </div>

        <p className={`${styles.block__text} mb-0`}>
          <b>У вас еще нет активной подписки,</b> а в сервисе представлены лишь тестовые данные для демонстрации
          функционала.
        </p>

        <div className={styles.block__columnFooter}>
          <div className={styles.block__footerIconWrapper}>
            <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path
                d="M19 19L14.6569 14.6569M14.6569 14.6569C16.1046 13.2091 17 11.2091 17 9C17 4.58172 13.4183 1 9 1C4.58172 1 1 4.58172 1 9C1 13.4183 4.58172 17 9 17C11.2091 17 13.2091 16.1046 14.6569 14.6569Z"
                stroke="white" strokeWidth="2" strokeLinecap="round" strokeLinejoin="round" />
            </svg>
          </div>
          <p className={styles.block__subtext}>
            Обязательно пройдитесь по всем разделам, чтобы увидеть, какие возможности доступны для работы с финансами и
            бизнес-показателями.
          </p>
        </div>
      </div>

      <div className={`${styles.block__column} ${styles.block__column_right}`}>
        <p className={styles.block__text}>
          Чтобы подключить свой магазин и работать уже <b>с реальными данными, активируйте тестовый период.</b> <span>У вас будет {user.test_days ? getDayDeclension(user.test_days.toString()) : '3 дня'}, чтобы изучить функционал сервиса и убедиться в его удобстве.</span> Желаем
          удачи!
        </p>

        <ConfigProvider
          theme={{
            token: {
              colorPrimary: '#5329FF',
            }
          }}
        >
          <Button
            className={styles.block__actionButton}
            onClick={testPeriodActivation}
            size='large'
            type='primary'
            style={{
              height: 64
            }}
            loading={requestStatus.isLoading}
          >
            {!requestStatus.isSuccess && `Активировать тестовый период – ${user.test_days ? getDayDeclension(user.test_days.toString()) : '3 дня'}`}
            {requestStatus.isSuccess && requestStatus.message}
          </Button>
        </ConfigProvider>
      </div>

      <SubscriptionModal
        visible={isModalVisible}
        visibilityHandler={setIsModalVisible}
      />

      <ErrorModal
        footer={null}
        open={requestStatus.isError}
        onOk={() => setRequestStatus({ ...INIT_REQUEST_STATUS })}
        onClose={() => setRequestStatus({ ...INIT_REQUEST_STATUS })}
        onCancel={() => setRequestStatus({ ...INIT_REQUEST_STATUS })}
        message={requestStatus.message}
      />
    </div>
  );

  const demoUserBlock = (
    <div className={`${styles.demoUserBlock} ${className}`}>
      <div className={styles.block__column}>
        <div className={styles.demoUserBlock__welcomeBlock}>
          <div className={styles.demoUserBlock__iconWrapper}>
            <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path
                d="M18.3033 12.8089L17.5701 12.1289L18.3033 12.8089ZM11.2322 5.73783L11.9122 6.47103L11.2322 5.73783ZM21.6606 4.27232L22.6522 4.402L21.6606 4.27232ZM19.7688 2.38046L19.8985 3.37202L19.7688 2.38046ZM6.4941 12.6506L7.392 13.0908L6.4941 12.6506ZM11.3905 17.547L10.9503 16.6491L11.3905 17.547ZM5.20674 17.8674C5.59726 17.4769 5.59727 16.8437 5.20674 16.4532C4.81622 16.0627 4.18305 16.0627 3.79253 16.4532L5.20674 17.8674ZM0.9641 19.2816C0.573576 19.6722 0.573576 20.3053 0.9641 20.6958C1.35462 21.0864 1.98779 21.0864 2.37831 20.6958L0.9641 19.2816ZM7.32806 19.9887C7.71858 19.5982 7.71858 18.965 7.32806 18.5745C6.93754 18.184 6.30437 18.184 5.91385 18.5745L7.32806 19.9887ZM4.49963 19.9887C4.10911 20.3793 4.10911 21.0124 4.49963 21.4029C4.89016 21.7935 5.52332 21.7935 5.91385 21.4029L4.49963 19.9887ZM10.5958 21.082L11.5858 20.9406L11.5858 20.9406L10.5958 21.082ZM15.7577 17.6172L16.7477 17.4758L15.7577 17.6172ZM2.95907 13.4453L3.10049 12.4553L3.10049 12.4553L2.95907 13.4453ZM6.42389 8.2834L6.28247 9.27335L6.28247 9.27335L6.42389 8.2834ZM9.92676 16.4532L7.5879 14.1143L6.17369 15.5286L8.51254 17.8674L9.92676 16.4532ZM17.5701 12.1289C15.7103 14.1341 12.6724 15.8048 10.9503 16.6491L11.8307 18.4449C13.5735 17.5905 16.906 15.786 19.0365 13.4889L17.5701 12.1289ZM7.392 13.0908C8.23627 11.3687 9.90696 8.33084 11.9122 6.47103L10.5522 5.00464C8.25509 7.13512 6.45061 10.4676 5.5962 12.2104L7.392 13.0908ZM20.6691 4.14264C20.366 6.46004 19.5653 9.97761 17.5701 12.1289L19.0365 13.4889C21.4892 10.8444 22.3429 6.76695 22.6522 4.402L20.6691 4.14264ZM11.9122 6.47103C14.0635 4.4758 17.5811 3.6751 19.8985 3.37202L19.6391 1.38891C17.2742 1.69821 13.1967 2.55195 10.5522 5.00464L11.9122 6.47103ZM22.6522 4.402C22.8846 2.62531 21.4158 1.15654 19.6391 1.38891L19.8985 3.37202C20.3726 3.31001 20.7311 3.6685 20.6691 4.14264L22.6522 4.402ZM7.5879 14.1143C7.29549 13.8219 7.23366 13.4138 7.392 13.0908L5.5962 12.2104C5.03802 13.349 5.31513 14.67 6.17369 15.5286L7.5879 14.1143ZM8.51254 17.8674C9.3711 18.726 10.6921 19.0031 11.8307 18.4449L10.9503 16.6491C10.6273 16.8074 10.2192 16.7456 9.92676 16.4532L8.51254 17.8674ZM3.79253 16.4532L0.9641 19.2816L2.37831 20.6958L5.20674 17.8674L3.79253 16.4532ZM5.91385 18.5745L4.49963 19.9887L5.91385 21.4029L7.32806 19.9887L5.91385 18.5745ZM13 6.79845C11.8284 7.97003 11.8284 9.86952 13 11.0411L14.4142 9.62688C14.0237 9.23635 14.0237 8.60319 14.4142 8.21267L13 6.79845ZM13 11.0411C14.1716 12.2127 16.0711 12.2127 17.2426 11.0411L15.8284 9.62688C15.4379 10.0174 14.8047 10.0174 14.4142 9.62688L13 11.0411ZM17.2426 11.0411C18.4142 9.86952 18.4142 7.97003 17.2426 6.79845L15.8284 8.21267C16.219 8.60319 16.219 9.23636 15.8284 9.62688L17.2426 11.0411ZM17.2426 6.79845C16.0711 5.62688 14.1716 5.62688 13 6.79845L14.4142 8.21267C14.8047 7.82214 15.4379 7.82214 15.8284 8.21267L17.2426 6.79845ZM14.7678 17.7586L11.5858 20.9406L13 22.3548L16.182 19.1728L14.7678 17.7586ZM11.5858 20.9406L11.1615 17.9707L9.18163 18.2536L9.60589 21.2234L11.5858 20.9406ZM14.4849 15.7787L14.7678 17.7586L16.7477 17.4758L16.4648 15.4959L14.4849 15.7787ZM11.5858 20.9406L9.60589 21.2234C9.83897 22.855 11.8346 23.5202 13 22.3548L11.5858 20.9406ZM16.182 19.1728C16.6271 18.7277 16.8367 18.099 16.7477 17.4758L14.7678 17.7586L14.7678 17.7586L16.182 19.1728ZM4.86825 7.85913L1.68627 11.0411L3.10049 12.4553L6.28247 9.27335L4.86825 7.85913ZM2.81765 14.4352L5.78749 14.8595L6.07034 12.8796L3.10049 12.4553L2.81765 14.4352ZM8.54521 7.57629L6.56531 7.29345L6.28247 9.27335L8.26237 9.55619L8.54521 7.57629ZM1.68627 11.0411C0.520897 12.2065 1.18612 14.2022 2.81765 14.4352L3.10049 12.4553L3.10049 12.4553L1.68627 11.0411ZM6.28247 9.27335L6.56531 7.29345C5.94212 7.20442 5.31339 7.414 4.86825 7.85913L6.28247 9.27335Z"
                fill="#5329FF" />
            </svg>
          </div>
          <div className={styles.demoUserBlock__welcomeTitle}>
            <p className={`${styles.demoUserBlock__title} mb-0`}>Добро пожаловать в сервис Радар-Аналитика!</p>
            <p className={`${styles.demoUserBlock__text} mb-0`}>
              Пока у вас нет активной подписки, и доступны лишь тестовые данные для демонстрации функционала
            </p>

            <div className={styles.demoUserBlock__columnFooter}>
              <div>
                <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <g clipPath="url(#clip0_15589_68256)">
                    <path
                      d="M21 21L16.6569 16.6569M16.6569 16.6569C18.1046 15.2091 19 13.2091 19 11C19 6.58172 15.4183 3 11 3C6.58172 3 3 6.58172 3 11C3 15.4183 6.58172 19 11 19C13.2091 19 15.2091 18.1046 16.6569 16.6569Z"
                      stroke="#5329FF" strokeWidth="2" strokeLinecap="round" strokeLinejoin="round" />
                  </g>
                  <defs>
                    <clipPath id="clip0_15589_68256">
                      <rect width="24" height="24" fill="white" />
                    </clipPath>
                  </defs>
                </svg>
              </div>
              <p className={styles.demoUserBlock__subtext}>
                Обязательно загляните во все разделы, чтобы оценить функционал
              </p>
            </div>
          </div>
        </div>
      </div>

      <div className={`${styles.block__column} ${styles.demoUserBlock__column_right}`}>
        <p className={styles.demoUserBlock__text}>
          Подключите магазин и активируйте 3-дневный тест, чтобы работать с реальными данными и оценить удобство
          сервиса.
        </p>

        <ConfigProvider
          theme={{
            token: {
              colorPrimary: '#5329FF',
            }
          }}
        >
          <Button
            className={styles.block__actionButton}
            onClick={logout}
            size='large'
            type='primary'
            style={{
              height: 46,
              width: '100%',
            }}
            loading={requestStatus.isLoading}
          >
            {!requestStatus.isSuccess && `Активировать тестовый период – ${user.test_days ? getDayDeclension(user.test_days.toString()) : '3 дня'}`}
            {requestStatus.isSuccess && requestStatus.message}
          </Button>
        </ConfigProvider>
      </div>

      <ErrorModal
        footer={null}
        open={requestStatus.isError}
        onOk={() => setRequestStatus({ ...INIT_REQUEST_STATUS })}
        onClose={() => setRequestStatus({ ...INIT_REQUEST_STATUS })}
        onCancel={() => setRequestStatus({ ...INIT_REQUEST_STATUS })}
        message={requestStatus.message}
      />
    </div>
  );
  const demoUserMainPageBlock = (
    <div className={`${styles.demoUserMPBlock} ${className}`}>
      <div className={styles.demoUserMPBlock__header}>
        <svg width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
          <rect width="32" height="32" rx="8" fill="#5329FF" />
          <path fillRule="evenodd" clipRule="evenodd" d="M23.0671 10.238C23.0592 9.52681 22.5161 8.9795 21.8049 8.96614C20.1739 8.93551 17.6883 9.43888 14.876 11.3744C13.9772 11.993 13.0441 12.7586 12.0946 13.7008C11.4568 14.3338 11.0358 14.824 10.7777 15.1987C10.5562 15.5204 10.4905 15.7064 10.4737 15.7905C10.5684 15.8354 10.7547 15.8806 11.0652 15.9016C11.4935 15.9306 11.9811 15.909 12.5065 15.8857C12.79 15.8731 13.0844 15.86 13.3865 15.8542C13.7911 15.8463 14.2051 15.8531 14.568 15.9081C14.908 15.9596 15.3255 16.0694 15.6199 16.3661C15.9142 16.6627 16.0209 17.0811 16.0698 17.4215C16.122 17.7847 16.1255 18.1988 16.1146 18.6033C16.1064 18.9053 16.0911 19.1997 16.0763 19.483C16.049 20.0082 16.0236 20.4957 16.0493 20.9241C16.068 21.2349 16.1117 21.4214 16.1559 21.5166C16.2401 21.5004 16.4266 21.4361 16.75 21.217C17.1267 20.9618 17.6201 20.5447 18.2579 19.9117C22.1753 16.0244 23.0909 12.3875 23.0671 10.238ZM21.8284 7.71636C23.2152 7.74241 24.3016 8.83716 24.317 10.2242C24.3373 12.0553 23.776 14.6459 21.8779 17.501C22.0136 17.7628 22.0924 18.0597 22.1279 18.3621C22.1855 18.8521 22.1371 19.4111 21.986 19.9978C21.6854 21.1652 20.9639 22.5008 19.7254 23.7389C19.5017 24.0134 19.1711 24.2061 18.8183 24.2578C18.4266 24.3152 17.9726 24.1964 17.6738 23.7863C17.3994 23.4096 17.3384 22.897 17.4132 22.3288C17.4157 22.31 17.4183 22.2911 17.4211 22.272C16.9814 22.5659 16.5425 22.7698 16.1193 22.7714C15.8856 22.7723 15.6593 22.7111 15.4613 22.5773C15.2687 22.4472 15.1381 22.2724 15.0495 22.099C14.881 21.7698 14.8236 21.3658 14.8016 20.999C14.7718 20.5031 14.8033 19.8871 14.8324 19.3165C14.8459 19.0523 14.8589 18.7978 14.865 18.5694C14.8755 18.1821 14.8691 17.8541 14.8325 17.5992C14.794 17.3315 14.7362 17.2515 14.7328 17.2468C14.7281 17.2433 14.6481 17.1844 14.3808 17.144C14.1261 17.1054 13.7982 17.0964 13.4108 17.1039C13.1824 17.1084 12.9278 17.1194 12.6635 17.1309C12.0927 17.1556 11.4765 17.1823 10.9808 17.1487C10.6142 17.1239 10.2106 17.0634 9.88269 16.8924C9.71003 16.8024 9.53627 16.6705 9.40761 16.4769C9.27533 16.2779 9.21589 16.0511 9.21857 15.8174C9.22337 15.3992 9.42586 14.9671 9.71757 14.5348C9.70606 14.5363 9.6946 14.5378 9.6832 14.5392C9.1144 14.6097 8.60232 14.5447 8.22775 14.2674C7.81997 13.9655 7.70461 13.5106 7.76503 13.1193C7.81945 12.767 8.01466 12.4378 8.29094 12.2162C9.5385 10.9873 10.8796 10.2761 12.0493 9.98442C12.6372 9.83785 13.1964 9.79377 13.686 9.85509C13.9815 9.8921 14.2714 9.97046 14.5279 10.1027C17.401 8.22305 19.9988 7.682 21.8284 7.71636ZM13.17 11.0792C12.9308 11.0851 12.6557 11.1215 12.3517 11.1973C11.4123 11.4315 10.2551 12.0282 9.14409 13.1305C9.12316 13.1512 9.10078 13.1705 9.07714 13.1881C9.04672 13.2108 9.02182 13.2475 9.00894 13.2801C9.0726 13.3031 9.22552 13.3363 9.52944 13.2987C9.92219 13.25 10.4952 13.0904 11.295 12.7336C11.9255 12.1137 12.552 11.5645 13.17 11.0792ZM19.2311 20.7309C18.8682 21.5279 18.7042 22.0997 18.6525 22.4921C18.6125 22.7957 18.6446 22.9489 18.6671 23.0127C18.6997 23.0001 18.7367 22.9755 18.7596 22.9452C18.7774 22.9217 18.7968 22.8995 18.8177 22.8787C19.9285 21.7762 20.5341 20.6236 20.7755 19.686C20.8536 19.3827 20.8921 19.1079 20.8999 18.8687C20.4099 19.483 19.8559 20.1052 19.2311 20.7309Z" fill="white" />
          <path fillRule="evenodd" clipRule="evenodd" d="M20.2017 12.4058C20.0384 12.5679 19.7746 12.5669 19.6125 12.4036C19.4504 12.2402 19.4514 11.9764 19.6148 11.8143C19.7781 11.6522 20.0419 11.6532 20.204 11.8166C20.3661 11.9799 20.3651 12.2437 20.2017 12.4058ZM21.0822 13.2931C20.4289 13.9415 19.3736 13.9374 18.7252 13.284C18.0769 12.6307 18.0809 11.5754 18.7343 10.927C19.3876 10.2787 20.4429 10.2827 21.0913 10.9361C21.7396 11.5895 21.7356 12.6447 21.0822 13.2931ZM12.4521 18.7932C12.845 18.7947 13.1622 19.1144 13.1607 19.5073C13.1595 19.8281 12.9437 20.1083 12.6339 20.1915L11.5569 20.4808C11.5383 20.4858 11.5265 20.4843 11.5181 20.4818C11.5079 20.4789 11.4959 20.4724 11.4851 20.4615C11.4743 20.4505 11.4679 20.4385 11.465 20.4283C11.4626 20.4198 11.4611 20.4081 11.4663 20.3895L11.7638 19.3148C11.8494 19.0056 12.1313 18.792 12.4521 18.7932ZM14.4107 19.5121C14.4149 18.4289 13.5401 17.5474 12.4569 17.5432C11.5725 17.5398 10.7951 18.1288 10.5592 18.9812L10.2616 20.056C9.98823 21.0434 10.8917 21.9538 11.8812 21.688L12.9582 21.3987C13.8124 21.1693 14.4073 20.3965 14.4107 19.5121Z" fill="white" />
        </svg>

        <div className={styles.demoUserMPBlock__textWrapper}>
          <p className={`${styles.demoUserBlock__title} mb-0`}>Давайте начнем работать! Активируйте свой тестовый период!</p>
          <p className={styles.demoUserMPBlock__text}>
            Тестовый период длится 3 дня и даст возможность ознакомиться со всеми преимуществами сервиса.
          </p>
        </div>
      </div>

      <ConfigProvider
        theme={{
          token: {
            colorPrimary: '#5329FF',
          }
        }}
      >
        <Button
          className={styles.demoUserMPBlock__actionButton}
          onClick={logout}
          size='large'
          type='primary'
          style={{
            height: 46,
            fontSize: 14,
            fontWeight: 600,
          }}
          loading={requestStatus.isLoading}
        >
          {!requestStatus.isSuccess && `Активировать тестовый период`}
          {requestStatus.isSuccess && requestStatus.message}
        </Button>
      </ConfigProvider>

      <ErrorModal
        footer={null}
        open={requestStatus.isError}
        onOk={() => setRequestStatus({ ...INIT_REQUEST_STATUS })}
        onClose={() => setRequestStatus({ ...INIT_REQUEST_STATUS })}
        onCancel={() => setRequestStatus({ ...INIT_REQUEST_STATUS })}
        message={requestStatus.message}
      />
    </div>
  );

  let toRender = regularBlock;
  if (isDemoUser && !isOnMainPage) {
    toRender = demoUserBlock;
  } else if (isDemoUser && isOnMainPage) {
    toRender = demoUserMainPageBlock;
  }
  return toRender;
};
export default NoSubscriptionWarningBlock;
